#例2-3-1  字符串举例
#字符串可以用单引号或双引号括起来。这时，单引号或双引号是python程序的标点符号。
print('abc')    #字母组成的字符串
print('13879029382')    #数字组成的字符串
print('qq: 832882') #数字字母组成的字符串
print("长沙市")  #汉字组成的字符串
print("9栋B座102室") #字母、数字和汉字组成的字符串
print("©版权所有，侵权必究。")  #第一个字符是版权符号。
print("It's me.")  #字符串的内容（It's me.）包含单引号
print('She said, "Hi"')  #字符串的内容（She said, "Hi"）包含双引号
print('空字符串示例：'+ '1' + '' + '2' + '' + '3')  #''是空字符串，即没内容的字符串
print('1' + ' ' + '2' + ' ' + '3')  #' '是空格字符串，内容是一个空格（空格也是一个字符）

#上面最后两行中，加号（+）是字符串拼接操作，把两个子串拼接成母串。
