# 例4-4-1 列表切片
# 切片的写法：列表[x:z]
players = ['charles', 'martina', 'michael', '马龙', '孙杨']
print("[0:3]:", players[0:3])  # [0:3]得到从下标0到下标3（不含下标3）之间的子列表
print("[1:4]:", players[1:4])  # 1~第2个元素。4~第5个元素（不含）

# 未指定起点或终点
print("[ :4]:", players[:4])  # 起点未指定，视为从下标0开始
print("[1: ]:", players[1:])  # 终点未指定，视为到列表末尾
print("[ : ]:", players[:])  # [:]是从下标0开始到列表末尾

# 负数作为下标
# -1是最后一个，-2是倒数第二，-3是倒数第三，...
print("[-2:-1]:", players[-2:-1])
print("[-3:  ]:", players[-3:])  # 终点是列表末尾

# 错误的用法。
print("[3:1]:", players[3:1])  # 3>1，生成空列表
print("[-1:-3]:", players[-1:-3])  # -1 > -3, 生成空列表
