# 答应多个分割线
def print_line(length, fu_hao):
    def do_print_line():
        print((length // 2) * fu_hao + "闭包" +(length // 2) * fu_hao)
    return do_print_line

result = print_line(40, "*")
result()
result()
result()
result()
# ********************闭包********************
# ********************闭包********************
# ********************闭包********************
# ********************闭包********************

result1 = print_line(40, "#")
result1()
result1()
result1()
result1()
###################闭包####################
###################闭包####################
###################闭包####################
###################闭包####################
